# 1. Дано слово. Получить и вывести на экран буквосочетание,
#    состоящее из его второго и четвертого символов.
#    Говорим второй символ, понимаем, что символ с индексом 1

# 2. Дано слово. Получить и вывести на экран буквосочетание,
#    состоящее из его третьего и  последнего символов.

# 3. Дано слово. Получить его часть, образованную второй, третьей и
#    четвертой буквами.

# 4. Дано слово, состоящее из четного числа букв.
#    Вывести на экран его первую половину, не используя цикл.

# 5. Дано слово. Получить его часть, образованную идущими подряд буквами,
#    начиная с m-й и заканчивая n-й.
#    Значение для m и n вводим через input()

# 6. Из слова <яблоко> путем «вырезок» и «склеек» его букв
#    получить слова блок и око.

# 7. Из слова <информатика> путем «вырезок» и «склеек» его букв
#    получить слова форма и тик.

# 8. Дано слово из четного числа букв. Поменять местами его половины.
