"""
Задача №1
Вход:
Программа запрашивает количество ЯП, которые вы уже знаете и имя ЯП, который вы учите сейчас.

Выход: После курса по "<lang>" вы будете знать <counter> + 1 ЯП.

Пример 1:
In:
Какой ЯП вы учите сейчас? Python
Сколько языков программирования вы уже знаете? 1

Out:
После курса по "Python" вы будете знать 2 ЯП.

Пример 2:
In:
Какой ЯП вы учите сейчас? JavaScript
Сколько языков программирования вы уже знаете? 10

Out:
После курса по "JavaScript" вы будете знать 11 ЯП.
"""

