third = {
    'July': {
        'week1': (9, 8, 2, 1),
        'week2': (9, 8, 2, 1)
    },
    'June': {
        'week2': (7, 9, 8.1, 2)
    },
    'March': {
        'week1': (8, 7, 11, 3),
        'week3': (9, 17, 2, 1)
    }
}

# ========
# Практика
# ========
# Используем словарь third.
# 1. Последний элемент первой недели('week1') в июле.


# 2. Вывести все месяцы, в которых есть данные за первую неделю?


# 3. Вывести элементы с индексами 1, 2 и 3 второй недели
# в тех месяцах, в которых она('week2') есть.
